swoodtke/eyeballs/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32s3"

# PSRAM — 412×412×2 = ~332 KB, needs PSRAM
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=n

# Flash size
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# Custom partition table (larger app partition for embedded blob frames)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Optimisation
CONFIG_COMPILER_OPTIMIZATION_SIZE=y


# Bluetooth — NimBLE (smaller footprint than Bluedroid)
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
